# Даны 2 числа a и b. Получить их сумму, разность и произведение

a = float(input('Введите число a: '))
b = float(input('Введите число b: '))

print('Сумма a + b =', a + b)
print('Разность a - b =', a - b)
print('Произведение a * b =', a * b)
